Repository: Shuhrat556/QR
Catalog: lib/l10n/app_*.arb
Languages: tg, uz

# taglineCreateScanShare
source: Create, Scan & Share
tg: Эҷод, скан ва мубодила
uz: Yarat, skan qil va ulash

source: Menu
tg: Меню
uz: Menyu

source: Scan
tg: Скан
uz: Skan

source: Scan Image
tg: Скан аз сурат
uz: Rasmni skan qilish

source: Favorites
tg: Дӯстдошта
uz: Sevimlilar

source: History
tg: Таърихча
uz: Tarix

source: My QR
tg: QR-и ман

source: Create QR
tg: Эҷоди QR
uz: QR yaratish

source: Settings
tg: Танзимот
uz: Sozlamalar

source: Share
tg: Мубодила
uz: Ulashish

source: Our Apps
tg: Барномаҳои мо
uz: Bizning ilovalar

source: Remove Ads
tg: Нест кардани реклама
uz: Reklamani olib tashlash

source: Coming soon
tg: Ба зудӣ
uz: Tez kunda

# scanHint
source: Point camera at a QR code
tg: Камераро ба QR-код равона кунед
uz: Kamerani QR kodga yo‘naltiring

# cameraPermissionRequired
source: Camera permission is required to scan QR codes.
tg: Барои скан иҷозати камера лозим аст.
uz: QR skan qilish uchun kamera ruxsati kerak.

source: Grant Camera Permission
tg: Иҷозати камера
uz: Kamera ruxsatini berish

source: Open Settings
tg: Кушодани танзимот
uz: Sozlamalarni ochish

# failedStartCamera
source: Failed to start camera.
tg: Камера оғоз нашуд.
uz: Kamerani ishga tushirib bo‘lmadi.

# failedReadImage
source: Failed to read image.
tg: Хондани сурат нашуд.
uz: Rasmni o‘qib bo‘lmadi.

# noQrFoundInImage
source: No QR code found in selected image.
tg: Дар сурат QR-код ёфт нашуд.
uz: Tanlangan rasmda QR kod topilmadi.

source: Zoom
tg: Наздиккунӣ
uz: Yaqin/Uzoq

# pickImage
source: Gallery
tg: Галерея
uz: Galereya

source: Clear all
tg: Ҳамаро тоза кунед
uz: Hammasini tozalash

# clearHistoryTitle
source: Clear history?
tg: Таърихча тоза шавад?
uz: Tarixni tozalaysizmi?

# clearHistoryBody
source: This will remove all generated and scanned entries.
tg: Ҳама сабтҳои тавлидшуда ва сканшуда нест мешаванд.
uz: Bu barcha yaratilgan va skan qilingan yozuvlarni o‘chiradi.

source: Cancel
tg: Бекор
uz: Bekor qilish

source: Clear
tg: Тоза
uz: Tozalash

source: No history yet.
tg: Ҳанӯз таърихча нест.
uz: Hali tarix yo‘q.

source: No favorites yet.
tg: Ҳанӯз дӯстдошта нест.
uz: Hali sevimlilar yo‘q.

# failedLoadHistory
source: Failed to load history.
tg: Боркунии таърихча номумкин шуд.
uz: Tarixni yuklab bo‘lmadi.

source: Retry
tg: Аз нав
uz: Qayta urinish

source: Generated
tg: Тавлидшуда
uz: Yaratilgan

source: Scanned
tg: Сканшуда
uz: Skan qilingan

source: App Version
tg: Версияи барнома
uz: Ilova versiyasi

source: Privacy
tg: Махфият
uz: Maxfiylik

# privacyDescription
source: All QR data is stored locally. Nothing is uploaded to servers.
tg: Ҳама маълумоти QR дар дастгоҳ нигоҳ дошта мешавад.
uz: Barcha QR ma’lumotlar lokal saqlanadi. Serverga yuborilmaydi.

source: Open Privacy Policy
tg: Кушодани сиёсати махфият
uz: Maxfiylik siyosatini ochish

source: Camera Permission
tg: Иҷозати камера
uz: Kamera ruxsati

source: Current status
tg: Ҳолати ҷорӣ
uz: Joriy holat

source: Loading...
tg: Бор шуда истодааст...
uz: Yuklanmoqda...

source: Granted
tg: Иҷозат дода шуд
uz: Berilgan

source: Denied
tg: Рад шуд
uz: Rad etilgan

source: Permanently denied
tg: Ҳамеша рад шуд
uz: Butunlay rad etilgan

source: Request Permission
tg: Дархости иҷозат
uz: Ruxsat so‘rash

source: Refresh
tg: Навсозӣ
uz: Yangilash

source: Appearance
tg: Намоиш
uz: Ko‘rinish

source: Theme Mode
tg: Режими ранг
uz: Mavzu rejimi

# themeSystem
source: System
tg: Системавӣ
uz: Tizim

# themeLight
source: Light
tg: Равшан
uz: Yorug‘

# themeDark
source: Dark
tg: Торик
uz: Qorong‘i

source: Language
tg: Забон
uz: Til

source: QR Content Type
tg: Навъи мундариҷаи QR
uz: QR kontent turi

# fillRequired
source: Fill required fields for live preview
tg: Барои пешнамоиш майдонҳои лозимаро пур кунед
uz: Jonli ko‘rish uchun kerakli maydonlarni to‘ldiring

source: Save PNG
tg: PNG нигоҳ доред
uz: PNG saqlash

source: Share PNG
tg: PNG мубодила
uz: PNG ulashish

source: Save to History
tg: Ба таърихча нигоҳ доред
uz: Tarixga saqlash

# savedPng
source: Saved PNG to gallery.
tg: PNG ба галерея нигоҳ дошта шуд.
uz: PNG galereyaga saqlandi.

source: Save failed
tg: Нигоҳдорӣ нашуд
uz: Saqlashda xato

source: Share failed
tg: Мубодила нашуд
uz: Ulashishda xato

source: Saved to history.
tg: Ба таърихча нигоҳ дошта шуд.
uz: Tarixga saqlandi.

source: History save failed
tg: Ба таърихча нигоҳдорӣ нашуд
uz: Tarixga saqlashda xato

source: Text
tg: Матн
uz: Matn

source: Phone
tg: Телефон
uz: Telefon

source: From Clipboard
tg: Аз clipboard
uz: Clipboarddan

source: Contact
tg: Тамос
uz: Kontakt

source: Geo
tg: Гео

source: Calendar
tg: Тақвим
uz: Kalendar

source: Other
tg: Дигар
uz: Boshqa

# myQrType
source: My QR
tg: QR-и ман

# clipboardData
source: Clipboard content
tg: Мундариҷаи clipboard
uz: Clipboard matni

source: Paste from clipboard
tg: Аз clipboard гузоред
uz: Clipboarddan olish

source: Clipboard loaded
tg: Clipboard пур шуд
uz: Clipboard yuklandi

# clipboardEmpty
source: Clipboard is empty
tg: Clipboard холӣ аст
uz: Clipboard bo‘sh

source: Enter text
tg: Матнро ворид кунед
uz: Matn kiriting

source: Subject (optional)
tg: Мавзуъ (ихтиёрӣ)
uz: Mavzu (ixtiyoriy)

source: Body (optional)
tg: Матн (ихтиёрӣ)
uz: Xabar (ixtiyoriy)

source: WiFi Password
tg: Пароли WiFi
uz: WiFi paroli

# wifiSecurity
source: Security
tg: Амният
uz: Himoya

# smsMessage
source: Message (optional)
tg: Паём (ихтиёрӣ)
uz: Xabar (ixtiyoriy)

source: Latitude
tg: Арзи ҷуғрофӣ
uz: Kenglik

source: Longitude
tg: Тӯли ҷуғрофӣ
uz: Uzunlik

# geoQuery
source: Label (optional)
tg: Ном (ихтиёрӣ)
uz: Nomi (ixtiyoriy)

# calendarTitle
source: Title
tg: Сарлавҳа
uz: Sarlavha

# calendarLocation
source: Location (optional)
tg: Ҷой (ихтиёрӣ)
uz: Joylashuv (ixtiyoriy)

# calendarDescription
source: Description (optional)
tg: Тавсиф (ихтиёрӣ)
uz: Tavsif (ixtiyoriy)

# calendarStart
source: Start (YYYY-MM-DD HH:MM)
tg: Оғоз (YYYY-MM-DD HH:MM)
uz: Boshlanish (YYYY-MM-DD HH:MM)

# calendarEnd
source: End (YYYY-MM-DD HH:MM)
tg: Анҷом (YYYY-MM-DD HH:MM)
uz: Tugash (YYYY-MM-DD HH:MM)

source: Raw content
tg: Мундариҷаи хом
uz: Xom kontent

source: Scan Result
tg: Натиҷаи скан
uz: Skan natijasi

source: Content
tg: Мундариҷа
uz: Kontent

source: Open Link
tg: Кушодани пайванд
uz: Havolani ochish

source: Call Number
tg: Занг задан
uz: Qo‘ng‘iroq qilish

source: Send Email
tg: Фиристодани email
uz: Email yuborish

source: Open
tg: Кушодан
uz: Ochish

source: Copy Content
tg: Нусха
uz: Kontentni nusxalash

source: Share Content
tg: Мубодила
uz: Kontentni ulashish

source: Copied to clipboard.
tg: Ба clipboard нусхабардорӣ шуд.
uz: Clipboardga nusxalandi.

source: Action failed
tg: Амал иҷро нашуд
uz: Amal bajarilmadi

source: My QR Profile
tg: Профили QR-и ман
uz: My QR profili

source: First name
tg: Ном
uz: Ism

source: Last name
tg: Насаб
uz: Familya

source: Birth date
tg: Рӯзи таваллуд
uz: Tug‘ilgan sana

source: Select date
tg: Интихоби сана
uz: Sana tanlash

source: Phone number
tg: Рақами телефон
uz: Telefon raqami

source: Address
tg: Суроға
uz: Manzil

source: Company
tg: Ширкат
uz: Kompaniya

source: Job title
tg: Вазифа
uz: Lavozim

source: Website
tg: Вебсайт
uz: Vebsayt

source: Notes
tg: Эзоҳ
uz: Izoh

source: Save profile
tg: Нигоҳ доштани профил
uz: Profilni saqlash

source: Profile saved.
tg: Профил нигоҳ дошта шуд.
uz: Profil saqlandi.

source: vCard preview
tg: Пешнамоиши vCard
uz: vCard ko‘rinishi

# profileEmpty
source: Fill profile fields to generate your QR
tg: Барои сохтани QR профилро пур кунед
uz: QR yaratish uchun profil maydonlarini to‘ldiring

# launchFailed
source: Failed to open link
tg: Кушодани пайванд нашуд
uz: Havolani ochib bo‘lmadi

# shareAppText
source: Check out QR Scanner & Generator app!
tg: Барномаи QR Scanner & Generator-ро санҷед!
uz: QR Scanner & Generator ilovasini ko‘ring!

# removeAdsPlaceholder
source: Remove Ads will be available soon.
tg: Хизматрасонии нест кардани реклама ба зудӣ.
uz: Reklamani olib tashlash funksiyasi tez kunda.

source: Scan handling failed
tg: Хатои коркарди скан
uz: Skan qayta ishlashda xato

source: WiFi SSID
uz: WiFi nomi
